import nltk
nltk.download('punkt')  # Download the punkt tokenizer models

from nltk.tokenize import sent_tokenize

text = """Початок роботи


Апаратні клавіші пристрою

 Клавіша                 Функція
                         • Натисніть і утримуйте для ввімкнення пристрою, коли він вимкнений.
                         • Натисніть, щоб увімкнути або заблокувати екран.
                         • Натисніть і утримуйте, щоб розпочати розмову з Bixby. Додаткову
 Бокова клавіша
                           інформацію дивіться у розділі Використання Bixby.
                         • Натисніть двічі або натисніть і утримуйте для запуску заданої програми або
                           функції.
 Бокова клавіша +        • Натисніть одночасно, щоб створити знімок екрана.
 клавіша зменшення
                         • Натисніть і утримуйте одночасно, щоб вимкнути пристрій.
 гучності


Налаштування бокової клавіші
Виберіть програму або функцію, яка запускатиметься подвійним натисненням або натисненням і
утриманням бокової клавіші.
Запустіть програму Налаштування, торкніться Додаткові функції → Бокова клавіша, а тоді виберіть
потрібну опцію.


Сенсорні кнопки
"""

sentences = sent_tokenize(text)
for idx, sentence in enumerate(sentences, start=1):
    print(f"Sentence {idx}: {sentence.strip()}\n")
